import deepcut

#BAG of WORD
positive_word = ['สอนเข้าใจ','ไม่ยาก','ชอบ','สอนดี','น่าสนใจ','สอนสนุก','สนุก'
                 ,'เยี่ยม','ดี','เข้าใจ','เข้าใจดี']
negative_word = ['ง่วง','สอนเร็ว','สอบยาก','ข้อสอบยาก','เสียงเบา','พูดเสียงเบา','จดไม่ทัน'
                 ,'พูดเร็ว','ไม่ค่อยเข้าใจ','งานเยอะ','ปล่อยช้า','ไม่เข้าใจ','ยาก']


commentList = ['อาจารย์สอนเข้าใจมากเลยค่ะ อธิบายด้วยคำพูดที่ไม่ยาก',
         'เสียงอาจารย์ทำให้หนูง่วงค่ะ','ไม่เข้าใจเลยครับ สอนเร็วมาก ','งานเยอะมากเลยค่ะ ToT',
         'ชอบที่อาจารย์ Quiz บ่อยๆครับ เป็นการบังคับตัวเองให้เตรียมความพร้อมเสมอ','ข้อสอบยากมาก',
         'อาจารย์สอนดีครอบคลุมเนื้อหา น่าสนใจมากๆเลยครับ','อาจารย์สอนสนุกมากเลยค่ะ',
         'อยากให้ทบทวนเนื้อหาก่อนสอบเพราะเรียนไม่ค่อยเข้าใจเท่าไหร่','อาจารย์พูดเสียงเบาไม่ได้ยินทำให้จดไม่ทัน',
         'สอนเข้าใจดีค่ะ แต่ปล่อยช้า','สอนดีค่ะ','เสียงเบามากค่ะ ทำให้ง่วง']

for x in commentList:
    list_word = deepcut.tokenize(x)

    for y in list_word:
        
        for pos in positive_word:
            if y == pos:
                print('Pos ',y)
                
        for neg in negative_word:
            if y == neg:
                print('Neg ',y)
# print(x)
#print('|'.join(list_word))
#file = open("ouput.txt","w") 
#file.write('|'.join(list_word))